In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

env: DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

In [25]:
%%sql

-- ### Exercise 1 - Customer order count
-- Get order count per customer for the month of 2014 January.
-- * Tables - `orders` and `customers`
-- * Data should be sorted in descending order by count and ascending order by customer id.
-- * Output should contain `customer_id`, `customer_fname`, `customer_lname` and `customer_order_count`.

--### Query 
SELECT c.customer_id,c.customer_fname,c.customer_lname,count(*) AS customer_order_count 
FROM customers c JOIN orders o 
ON c.customer_id=o.order_customer_id
WHERE  to_char(o.order_date::date,'yyyy-MM')='2014-01' 
GROUP BY c.customer_id,c.customer_fname,c.customer_lname ORDER BY customer_order_count DESC LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(8622, 'Shirley', 'Smith', 5),
 (9676, 'Theresa', 'Smith', 5),
 (3710, 'Ashley', 'Smith', 4),
 (2555, 'Mary', 'Long', 4),
 (3199, 'Ashley', 'Hernandez', 4),
 (3610, 'Jordan', 'Smith', 4),
 (222, 'Frank', 'Ruiz', 4),
 (7, 'Melissa', 'Wilcox', 4),
 (2485, 'Mary', 'Hernandez', 4),
 (2444, 'Kenneth', 'Smith', 4)]

In [ ]:
%%sql
-- ### Exercise 2 - Dormant Customers

-- Get the customer details who have not placed any order for the month of 2014 January.
-- * Tables - `orders` and `customers`
-- * Output Columns - **All columns from customers as is**
-- * Data should be sorted in ascending order by `customer_id`
-- * Output should contain all the fields from `customers`
-- * Make sure to run below provided validation queries and validate the output.

--### Query :METHOD:1
--SELECT c.* FROM customers AS c  WHERE NOT EXISTS (SELECT 1 FROM orders AS o  
--WHERE o.order_customer_id=c.customer_id AND to_char(o.order_date::date,'yyyy-MM') ='2014-01')
--ORDER BY c.customer_id LIMIT 10;

--### METHOD:2
SELECT c.*
FROM customers AS c
    LEFT OUTER JOIN orders AS o
        ON o.order_customer_id = c.customer_id
            AND to_char(order_date, 'yyyy-MM') = '2014-01'

    WHERE o.order_customer_id IS NULL
ORDER BY 1
LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, 'Richard', 'Hernandez', 'XXXXXXXXX', 'XXXXXXXXX', '6303 Heather Plaza', 'Brownsville', 'TX', '78521'),
 (2, 'Mary', 'Barrett', 'XXXXXXXXX', 'XXXXXXXXX', '9526 Noble Embers Ridge', 'Littleton', 'CO', '80126'),
 (3, 'Ann', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '3422 Blue Pioneer Bend', 'Caguas', 'PR', '00725'),
 (4, 'Mary', 'Jones', 'XXXXXXXXX', 'XXXXXXXXX', '8324 Little Common', 'San Marcos', 'CA', '92069'),
 (5, 'Robert', 'Hudson', 'XXXXXXXXX', 'XXXXXXXXX', '10 Crystal River Mall ', 'Caguas', 'PR', '00725'),
 (6, 'Mary', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '3151 Sleepy Quail Promenade', 'Passaic', 'NJ', '07055'),
 (9, 'Mary', 'Perez', 'XXXXXXXXX', 'XXXXXXXXX', '3616 Quaking Street', 'Caguas', 'PR', '00725'),
 (10, 'Melissa', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '8598 Harvest Beacon Plaza', 'Stafford', 'VA', '22554'),
 (11, 'Mary', 'Huffman', 'XXXXXXXXX', 'XXXXXXXXX', '3169 Stony Woods', 'Caguas', 'PR', '00725'),
 (12, 'Christopher', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '5594 Jagged Embers By-pass', 'San Antonio', 'TX', '78227')]

In [60]:
%%sql
-- ### Exercise 3 - Revenue Per Customer

-- Get the revenue generated by each customer for the month of 2014 January
-- * Tables - `orders`, `order_items` and `customers`
-- * Data should be sorted in descending order by revenue and then ascending order by `customer_id`
-- * Output should contain `customer_id`, `customer_fname`, `customer_lname`, `customer_revenue`.
-- * If there are no orders placed by customer, then the corresponding revenue for a given customer should be 0.
-- * Consider only `COMPLETE` and `CLOSED` orders

--## QUERY
SELECT c.customer_id,
    c.customer_fname,
    c.customer_lname,
    ROUND(COALESCE(SUM(o.order_item_subtotal), 0)::numeric,2) AS customer_revenue
FROM customers AS c
    LEFT OUTER JOIN (
        SELECT od.order_id,
        od.order_customer_id,
        oi.order_item_subtotal 
        FROM orders od 
            JOIN order_items oi 
                ON od.order_id=oi.order_item_order_id 
                AND to_char(od.order_date, 'yyyy-MM') = '2014-01' 
                AND od.order_status IN ('COMPLETE','CLOSED') ) AS o
        ON o.order_customer_id = c.customer_id
    
GROUP BY 1,2,3
ORDER BY customer_revenue DESC,1
LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(2555, 'Mary', 'Long', Decimal('2954.63')),
 (3465, 'Mary', 'Gardner', Decimal('2929.74')),
 (3710, 'Ashley', 'Smith', Decimal('2739.82')),
 (1780, 'Larry', 'Sharp', Decimal('2689.65')),
 (986, 'Catherine', 'Hawkins', Decimal('2629.90')),
 (9676, 'Theresa', 'Smith', Decimal('2599.84')),
 (1847, 'Mary', 'Smith', Decimal('2589.87')),
 (11901, 'Mary', 'Smith', Decimal('2469.87')),
 (4618, 'Andrea', 'Smith', Decimal('2429.82')),
 (10896, 'Victoria', 'Smith', Decimal('2419.78'))]

In [54]:
%%sql

SELECT c.customer_id,
    c.customer_fname,
    c.customer_lname,
    coalesce(round(sum(oi.order_item_subtotal)::numeric, 2), 0) AS customer_revenue
FROM customers AS c
    LEFT OUTER JOIN orders AS o
        ON o.order_customer_id = c.customer_id
            AND to_char(order_date, 'yyyy-MM') = '2014-01'
            AND o.order_status IN ('COMPLETE', 'CLOSED')
    LEFT OUTER JOIN order_items AS oi
        ON o.order_id = oi.order_item_order_id
GROUP BY 1, 2, 3
ORDER BY 4 DESC, 1
LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(2555, 'Mary', 'Long', Decimal('2954.63')),
 (3465, 'Mary', 'Gardner', Decimal('2929.74')),
 (3710, 'Ashley', 'Smith', Decimal('2739.82')),
 (1780, 'Larry', 'Sharp', Decimal('2689.65')),
 (986, 'Catherine', 'Hawkins', Decimal('2629.90')),
 (9676, 'Theresa', 'Smith', Decimal('2599.84')),
 (1847, 'Mary', 'Smith', Decimal('2589.87')),
 (11901, 'Mary', 'Smith', Decimal('2469.87')),
 (4618, 'Andrea', 'Smith', Decimal('2429.82')),
 (10896, 'Victoria', 'Smith', Decimal('2419.78'))]

In [76]:
%%sql
-- ### Exercise 4 - Revenue Per Category

-- Get the revenue generated for each category for the month of 2014 January
-- * Tables - `orders`, `order_items`, `products` and `categories`
-- * Data should be sorted in ascending order by `category_id`.
-- * Output should contain all the fields from `categories` along with the revenue as `category_revenue`.
-- * Consider only `COMPLETE` and `CLOSED` orders

SELECT c.*,
    coalesce(round(sum(oi.order_item_subtotal)::numeric, 2), 0) AS category_revenue
FROM categories AS c
    LEFT OUTER JOIN products AS p
        ON p.product_category_id = c.category_id
    LEFT OUTER JOIN order_items AS oi
        ON p.product_id = oi.order_item_product_id
    LEFT OUTER JOIN orders AS o
        ON o.order_id = oi.order_item_order_id
            AND to_char(order_date, 'yyyy-MM') = '2014-01'
            AND o.order_status IN ('COMPLETE', 'CLOSED')
    
GROUP BY 1, 2, 3
ORDER BY 4 DESC, 1
LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(45, 7, 'Fishing', Decimal('6929653.50')),
 (17, 4, 'Cleats', Decimal('4431942.66')),
 (43, 7, 'Camping & Hiking', Decimal('4118425.42')),
 (9, 3, 'Cardio Equipment', Decimal('3694843.20')),
 (24, 5, "Women's Apparel", Decimal('3147800.00')),
 (48, 7, 'Water Sports', Decimal('3113844.60')),
 (18, 4, "Men's Footwear", Decimal('2891757.54')),
 (46, 7, 'Indoor/Outdoor Games', Decimal('2888993.94')),
 (29, 5, 'Shop By Sport', Decimal('1309522.02')),
 (37, 6, 'Electronics', Decimal('255679.39'))]

In [ ]:
%%sql

SELECT c.category_id,
    c.category_department_id,
    c.category_name,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS category_revenue
FROM categories AS c
    JOIN products AS p
        ON c.category_id = p.product_category_id
    JOIN order_items AS 
    
        ON p.product_id = oi.order_item_product_id
    JOIN orders AS o
        ON o.order_id = oi.order_item_order_id
        AND o.order_status IN ('COMPLETE', 'CLOSED')
        AND to_char(o.order_date, 'yyyy-MM') = '2014-01'
GROUP BY 1, 2, 3
ORDER BY 4 DESC,1
LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(45, 7, 'Fishing', Decimal('250787.46')),
 (17, 4, 'Cleats', Decimal('152374.72')),
 (43, 7, 'Camping & Hiking', Decimal('148190.12')),
 (9, 3, 'Cardio Equipment', Decimal('133156.77')),
 (24, 5, "Women's Apparel", Decimal('114800.00')),
 (48, 7, 'Water Sports', Decimal('113544.33')),
 (18, 4, "Men's Footwear", Decimal('107631.72')),
 (46, 7, 'Indoor/Outdoor Games', Decimal('100309.86')),
 (29, 5, 'Shop By Sport', Decimal('40090.24')),
 (37, 6, 'Electronics', Decimal('9261.72'))]